Revit 2024 API
ClipPlane.Origin Property
 The plane's origin.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public XYZ Origin { get; set; }
Visual Basic
Public Property Origin As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace